In [2]:
import pandas as pd
dados = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
lista1 = list('321')
lista1 #será nosso index

['3', '2', '1']

In [4]:
lista2 = list('ZYX')

In [6]:
df_dados = pd.DataFrame(dados, lista1, lista2) #não preciso especificar DATA = DADOS, INDEX = LISTA1, COLUMNS = LISTA2

In [8]:
df_dados
#SORT_INDEX

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [10]:
df_dados.sort_index() #aqui ele apenas muda, mas se eu chamar de novo meu DF, ele nao estará nessa posição
#para isso eu uso o INPLACE = TRUE

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [12]:
df_dados

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [15]:
df_dados.sort_index(inplace=True)
df_dados

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [19]:
df_dados.sort_index(axis=1, inplace=True)

In [21]:
df_dados

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [25]:
#SORT_VALUES()
df_dados.sort_values(by = 'X', inplace = True) #classificando dando uma variável (X)
df_dados

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [27]:
#classificando dando duas variáveis (X E Y)
df_dados.sort_values(by = ['X','Y'], inplace = True)
df_dados

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [30]:
df_dados.sort_values(by = '3', axis = 1, inplace = True)
df_dados

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9